АлогистикТест2/src/Documents/рфп_ОтгрузкаВагона/рфп_ОтгрузкаВагона.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>рфп_ОтгрузкаВагона</name>
  <registerRecords>AccumulationRegister.алк_ОстаткиНесортированного</registerRecords>
  <registerRecords>AccumulationRegister.алк_ОборотыПроизводства</registerRecords>
  <registerRecords>AccumulationRegister.алк_ПроизводствоОборот</registerRecords>
  <attributes>
    <name>НомерВагона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерНакладной</name>
    <comment>Номер ЖД накладной</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Производитель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>_Производитель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сертификат</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.алк_СтатусыВходящейОтгрузки</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПрибытия</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРазгрузки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>РазгруженСобственнымиСилами</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Загружен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидТранспортировки</name>
    <type>
      <types>EnumRef.алк_ВидыТранспортировки</types>
    </type>
  </attributes>
  <attributes>
    <name>Участок</name>
    <type>
      <types>CatalogRef.алк_Участки</types>
    </type>
  </attributes>
  <attributes>
    <name>СтанцияОтправления</name>
    <type>
      <types>CatalogRef.алк_ЛогистическиеЦентры</types>
    </type>
  </attributes>
  <tabularSections>
    <name>_Пиловочник</name>
    <attributes>
      <name>Товар</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Пиловочник</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Порода</name>
      <type>
        <types>CatalogRef.Породы</types>
      </type>
    </attributes>
    <attributes>
      <name>_Порода</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сорт</name>
      <type>
        <types>CatalogRef.Сорта</types>
      </type>
    </attributes>
    <attributes>
      <name>_Сорт</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Длина</name>
      <type>
        <types>CatalogRef.Длины</types>
      </type>
    </attributes>
    <attributes>
      <name>_Длина</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сечение</name>
      <type>
        <types>CatalogRef.РазмерСечения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

АлогистикТест2/src/Enums/алк_СтатусыВходящейОтгрузки/алк_СтатусыВходящейОтгрузки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>алк_СтатусыВходящейОтгрузки</name>
  <enumValues>
    <name>ВПути</name>
    <comment>Выехал с пункта отправления</comment>
  </enumValues>
  <enumValues>
    <name>Прибыл</name>
    <comment>Транспорт приехал на АЛК</comment>
  </enumValues>
  <enumValues>
    <name>Разгружен</name>
    <comment>Разгрузиди несортированную</comment>
  </enumValues>
  <enumValues>
    <name>Принят</name>
    <comment>Оформлен акт приемки</comment>
  </enumValues>
</mdclass:Enum>

АлогистикТест2/src/Enums/алк_ВидыТранспортировки/алк_ВидыТранспортировки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>алк_ВидыТранспортировки</name>
  <enumValues>
    <name>Автомобильная</name>
  </enumValues>
  <enumValues>
    <name>Железнодорожная</name>
  </enumValues>
  <enumValues>
    <name>Теплоход</name>
  </enumValues>
</mdclass:Enum>

АлогистикТест2/src/Documents/рфп_ОтгрузкаВагона/Forms/ФормаДокумента/Module.bsl
/// печать
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// СтандартныеПодсистемы.Печать
	УправлениеПечатью.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюПечать);
	// Конец СтандартныеПодсистемы.Печать
	
	УправлениеНебольшойФирмойСервер.УстановитьОтображаниеПодменюПечати(Элементы.ПодменюПечать);
		
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуПечати(Команда)
	
	УправлениеПечатьюКлиент.ВыполнитьПодключаемуюКомандуПечати(Команда, ЭтаФорма, Объект);
	// УНФ
	СтатистикаИспользованияФормКлиент.ДобавитьСтатистикуКомандПечати(ЭтотОбъект, Команда);
	// Конец УНФ
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусПриИзменении(Элемент)
	
	УстановитьДатуПриИзмененииСтатуса();
	УстановитьУсловноеОформление();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьУсловноеОформление();
	Если Не ЗначениеЗаполнено(Объект.Ссылка) тогда
		ПриИзмененииИдентификаторовТранспорта();
	Иначе
		элементы.декорацияАналогичныеИдентификаторы.Видимость = Ложь;
	КонецЕсли; 
	Если Объект.Статус = ПредопределенноеЗначение("Перечисление.алк_СтатусыВходящейОтгрузки.Принят") тогда
		ДокументАктПриемки = ПолучитьСвязанныйАктПриемки(Объект.Ссылка);
		Элементы.ДокументАктПриемки.Видимость = ЗначениеЗаполнено(ДокументАктПриемки);
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСвязанныйАктПриемки(Отгрузка)
	Возврат Документы.алк_ПриемкаЛесопродукции.НайтиПоРеквизиту("Партия", Отгрузка);	
КонецФункции


&НаКлиенте
Процедура УстановитьУсловноеОформление()
	Если Объект.Статус = ПредопределенноеЗначение("Перечисление.алк_СтатусыВходящейОтгрузки.ВПути") тогда
		Элементы.ДатаПрибытия.Видимость = Ложь;
		Элементы.грРазгрузка.Видимость = Ложь;
	ИначеЕсли Объект.Статус = ПредопределенноеЗначение("Перечисление.алк_СтатусыВходящейОтгрузки.Прибыл") тогда
		Элементы.ДатаПрибытия.Видимость = Истина;
		Элементы.грРазгрузка.Видимость = Ложь;
	ИначеЕсли Объект.Статус = ПредопределенноеЗначение("Перечисление.алк_СтатусыВходящейОтгрузки.Разгружен")
		 или Объект.Статус = ПредопределенноеЗначение("Перечисление.алк_СтатусыВходящейОтгрузки.Принят") тогда
		Элементы.ДатаПрибытия.Видимость = Истина;
		Элементы.грРазгрузка.Видимость = Истина;
	КонецЕсли;
	элементы.декорЗагружен.Видимость = Объект.Загружен;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДатуПриИзмененииСтатуса()
	Если Объект.Статус = ПредопределенноеЗначение("Перечисление.алк_СтатусыВходящейОтгрузки.Прибыл") тогда
		Объект.ДатаПрибытия = ТекущаяДата();
	ИначеЕсли Объект.Статус = ПредопределенноеЗначение("Перечисление.алк_СтатусыВходящейОтгрузки.Разгружен") тогда
		Объект.ДатаРазгрузки = ТекущаяДата();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НомерНакладнойПриИзменении(Элемент)
	ПриИзмененииИдентификаторовТранспорта();
КонецПроцедуры

&НаКлиенте
Процедура НомерВагонаПриИзменении(Элемент)
	
	ПриИзмененииИдентификаторовТранспорта(); 
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииИдентификаторовТранспорта()
	
	ЗаписьЗапрещена = Ложь;
	
	Если ЗначениеЗаполнено(Объект.НомерВагона) И ЗначениеЗаполнено(Объект.НомерНакладной) тогда
		Результат = НайтиДокументПоИдентификатору(Объект.Ссылка, Объект.НомерВагона, Объект.НомерНакладной);
		Если Не Результат = Неопределено тогда
			ЗаписьЗапрещена = Истина;
			СсылкаНаАналогичныйДокумент = Результат; 
			элементы.декорацияАналогичныеИдентификаторы.Заголовок = "Запись запрещена. Используете документ "+Строка(СсылкаНаАналогичныйДокумент);
		КонецЕсли;
	КонецЕсли;
	
	элементы.декорацияАналогичныеИдентификаторы.Видимость = ЗаписьЗапрещена;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция НайтиДокументПоИдентификатору(ДокументСсылка, НомерТранспорта, НомерНакладной)
	
	Результат = Неопределено;
	Запрос = новый запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	рфп_ОтгрузкаВагона.Ссылка
	|ИЗ
	|	Документ.рфп_ОтгрузкаВагона КАК рфп_ОтгрузкаВагона
	|ГДЕ
	|	рфп_ОтгрузкаВагона.Проведен
	|	И НЕ рфп_ОтгрузкаВагона.Ссылка = &ДокументСсылка
	|	И рфп_ОтгрузкаВагона.НомерВагона = &НомерВагона
	|	И рфп_ОтгрузкаВагона.НомерНакладной = &НомерНакладной");
	Запрос.УстановитьПараметр("ДокументСсылка", ДокументСсылка);
	Запрос.УстановитьПараметр("НомерВагона", НомерТранспорта);
	Запрос.УстановитьПараметр("НомерНакладной", НомерНакладной);
	
	результатЗапроса = Запрос.Выполнить().Выбрать();
	Если результатЗапроса.Следующий() тогда
		Результат = результатЗапроса.Ссылка;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура декорацияАналогичныеИдентификаторыНажатие(Элемент)
	ПоказатьЗначение(Неопределено, СсылкаНаАналогичныйДокумент);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)

	Если ЗаписьЗапрещена тогда
		Отказ = Истина;
		Сообщить("Запрещено вводить дубль существующего документа. Для записи используйте документ "+ Строка(СсылкаНаАналогичныйДокумент));
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ВидТранспортировки) Тогда
		Если СтрНайти("абвгдеёжзийклмнопрстуфхцчшщъыьэюя",Лев(НРег(Объект.НомерВагона),1)) = 0  Тогда 
			Объект.ВидТранспортировки = ПредопределенноеЗначение("Перечисление.алк_ВидыТранспортировки.Железнодорожная");
		Иначе 
			Объект.ВидТранспортировки = ПредопределенноеЗначение("Перечисление.алк_ВидыТранспортировки.Автомобильная"); 
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьОбъемПоХарактеристике(Длина,Сечение)
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВЫБОР
	               |		КОГДА алк_ПараметрыХарактеристик.Характеристика = NULL
	               |			ТОГДА 0
	               |		ИНАЧЕ алк_ПараметрыХарактеристик.Объем
	               |	КОНЕЦ КАК Объем
	               |ИЗ
	               |	РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
	               |ГДЕ
	               |	алк_ПараметрыХарактеристик.Длина = &Длина
	               |	И алк_ПараметрыХарактеристик.Сечение = &Сечение";
	
	Запрос.УстановитьПараметр("Длина",Длина);
	Запрос.УстановитьПараметр("Сечение",Сечение);

	Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(Запрос.Выполнить().Выгрузить());   
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьОбъем()
	
	ТекДанные = Элементы.Пиловочник.ТекущиеДанные; 
		
	Если Не ЗначениеЗаполнено(ТекДанные.Длина) ИЛИ Не ЗначениеЗаполнено(ТекДанные.Сечение)  Тогда 
		Возврат;
	КонецЕсли;
	
	ОбъемМассив = ПолучитьОбъемПоХарактеристике(ТекДанные.Длина,ТекДанные.Сечение);
	
	Если ОбъемМассив.Количество() = 0 Тогда 
		ТекДанные.Объем = 0; 
		Возврат;
	КонецЕсли;
	
	ТекДанные.Объем = ТекДанные.Количество*ОбъемМассив[0].Объем; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПиловочникКоличествоПриИзменении(Элемент)
	
	ЗаполнитьОбъем();
	
КонецПроцедуры

&НаКлиенте
Процедура ПиловочникДлинаПриИзменении(Элемент) 
		
	ЗаполнитьОбъем();
	
КонецПроцедуры

&НаКлиенте
Процедура ПиловочникСечениеПриИзменении(Элемент)
		
	ЗаполнитьОбъем();
	
КонецПроцедуры 

&НаСервереБезКонтекста
Функция  ПолучитьКатегориюНоменклатуры(Номенклатура)
		
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	Номенклатура.КатегорияНоменклатуры
	               |ИЗ
	               |	Справочник.Номенклатура КАК Номенклатура
	               |ГДЕ
	               |	Номенклатура.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка",Номенклатура);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		Возврат Выборка.КатегорияНоменклатуры;
	КонецЦикла;
	
КонецФункции

&НаКлиенте
Процедура ПиловочникНоменклатураПриИзменении(Элемент)
		
	ТекДанные = Элементы.Пиловочник.ТекущиеДанные;
	
	Если ТекДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТекДанные.Номенклатура) Тогда
		КатегорияТекСтроки = "";
		Возврат;
	КонецЕсли;
	
	КатегорияТекСтроки = ПолучитьКатегориюНоменклатуры(ТекДанные.Номенклатура);

			
КонецПроцедуры

&НаКлиенте
Процедура ПиловочникПриАктивизацииСтроки(Элемент)
	
	ТекДанные = Элементы.Пиловочник.ТекущиеДанные;
	
	Если ТекДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТекДанные.Номенклатура) Тогда
		КатегорияТекСтроки = "";
		Возврат;
	КонецЕсли;
	
	КатегорияТекСтроки = ПолучитьКатегориюНоменклатуры(ТекДанные.Номенклатура);

КонецПроцедуры
